# SketchNonPlanarFreeForm Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..SketchNonPlanarFreeForm Property
BuiltInFailures..::..RebarFailures Class See Also
---
The selected free form rebar is not planar. Sketching it will discard the current geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SketchNonPlanarFreeForm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchNonPlanarFreeForm As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SketchNonPlanarFreeForm {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace